/* No comment provided by engineer. */
"%@ (Disabled: %@)" = "%1$@（已禁用：%2$@）";

/* No comment provided by engineer. */
"%@ can't be empty" = "%@不能为空";

/* No comment provided by engineer. */
"(Tap to edit, hold to re-order)" = "（点击编辑，长按重新排序）";

/* No comment provided by engineer. */
"(Use Default)" = "（使用默认）";

/* SettingsViewController */
"About" = "关于";

/* No comment provided by engineer. */
"Add Bookmark" = "添加书签";

/* No comment provided by engineer. */
"All rules" = "所有规则";

/* No comment provided by engineer. */
"Allow hosts to access WebRTC functions" = "允许主机访问 WebRTC 功能";

/* No comment provided by engineer. */
"Allow hosts to permanently store cookies and local storage databases" = "允许主机永久存储 cookie 和本地存储数据库";

/* No comment provided by engineer. */
"Allow HTTPS hosts to load page resources from non-HTTPS hosts (useful for RSS readers and other aggregators)" = "允许 HTTPS 主机从非 HTTPS 主机加载页面资源（此规则对 RSS 阅读器和其他聚合器有用）";

/* No comment provided by engineer. */
"Allow mixed-mode resources" = "允许混合模式资源";

/* No comment provided by engineer. */
"Allow persistent cookies" = "允许持久性 cookie";

/* No comment provided by engineer. */
"Allow this host to access WebRTC functions" = "允许该主机使用 WebRTC 功能";

/* No comment provided by engineer. */
"Allow this host to permanently store cookies and local storage databases" = "允许该主机永久存储 cookie 和本地存储数据库";

/* No comment provided by engineer. */
"Allow this HTTPS host to load page resources from non-HTTPS hosts (useful for RSS readers and other aggregators)" = "允许该 HTTPS 主机从非 HTTPS 主机加载页面资源（此规则对 RSS 阅读器和其他聚合器有用）";

/* No comment provided by engineer. */
"Allow this page to close its tab?" = "是否允许该页面关闭其标签页？";

/* No comment provided by engineer. */
"Allow WebRTC" = "允许 WebRTC";

/* No comment provided by engineer. */
"An error occurred downloading image %@" = "下载图片出错 %@";

/* Donate Scene. */
"Are you sure you want to send a %@ tip?" = "请确认你想捐助 %@ 吗？";

/* No comment provided by engineer. */
"Authentication Required" = "需验证";

/* SettingsViewController */
"Auto-Complete Search Results" = "自动完成搜索结果";

/* No comment provided by engineer. */
"Block external LAN requests" = "阻拦外部的 LAN 请求";

/* No comment provided by engineer. */
"Blocked 3rd-Party Hosts" = "已阻拦第三方主机";

/* No comment provided by engineer. */
"Bookmarks" = "书签";

/* Cancel
   Cancel action */
"Cancel" = "取消";

/* SettingsViewController */
"Choose, how long app remembers open tabs." = "选择应用记住打开的标签页多久";

/* No comment provided by engineer. */
"Close Tab" = "关闭标签页";

/* No comment provided by engineer. */
"Confirm" = "确认";

/* Donate Scene. */
"Confirm %@" = "捐助 %@";

/* Donate Scene. */
"Confirm Purchase" = "确认购买";

/* No comment provided by engineer. */
"Content policy" = "内容政策";

/* No comment provided by engineer. */
"Copy URL" = "复制 URL";

/* No comment provided by engineer. */
"Create New Tab" = "新建标签页";

/* No comment provided by engineer. */
"Custom settings" = "自定义设置";

/* No comment provided by engineer. */
"Custom user-agent string, or blank to use the default" = "自定义用户代理字符串，空白时使用默认";

/* No comment provided by engineer. */
"Default Settings" = "默认设置";

/* No comment provided by engineer. */
"Disable" = "禁用";

/* No comment provided by engineer. */
"Disabled: %@" = "已禁用：%@";

/* Donate Scene. */
"Donate" = "捐助";

/* No comment provided by engineer. */
"Done" = "完成";

/* No comment provided by engineer. */
"Double-tap to dismiss pop-up window." = "双击忽略弹出窗口。";

/* No comment provided by engineer. */
"Edit Bookmark" = "编辑书签";

/* No comment provided by engineer. */
"Enable" = "启用";

/* No comment provided by engineer. */
"Enter the details of the URL to bookmark:" = "输入要加入书签的URL的详细信息：";

/* No comment provided by engineer. */
"Enter the host/domain to define settings for" = "输入设置所作用于的主机/域";

/* No comment provided by engineer. */
"Error" = "错误";

/* No comment provided by engineer. */
"Fill with 1Password" = "使用 1Password 填充";

/* No comment provided by engineer. */
"Focus URL Field" = "指向 URL 字段";

/* Donate Scene. */
"Fund Development" = "资助开发";

/* No comment provided by engineer. */
"Global Settings" = "全局设置";

/* No comment provided by engineer. */
"Bridge Configuration" = "网桥配置";

/* No comment provided by engineer. */
"Tor connection failure" = "Tor 连接失败";

/* No comment provided by engineer. */
"__CONNECTION_FAILURE_DESCRIPTION__" = "Onion 浏览器与 Tor 匿名网络的连接断掉，并且无法重连，可能是因为 Onion 浏览器进入后台运行状态，或者浏览器虽然处于活动状态，但设备休眠。\n\n请退出并重启该应用，再次连接。如需保存当前页面为书签或其内容，请按“确定”停留在当前应用中，这样无需网络也可进行以上操作。";

/* No comment provided by engineer. */
"Quit App" = "退出应用";

/* No comment provided by engineer. */
"Go Back" = "返回";

/* No comment provided by engineer. */
"Go Forward" = "继续";

/* No comment provided by engineer. */
"Handle tapping on links in a non-standard way to avoid possibly opening external applications" = "通过非标准方式处理链接点击，避免打开外部应用的潜在可能";

/* No comment provided by engineer. */
"Handle tapping on links on pages from this host in a non-standard way to avoid possibly opening external applications" = "通过非标准方式处理该主机页面上的链接点击，避免打开外部应用的潜在可能";

/* No comment provided by engineer. */
"Host Settings" = "主机设置";

/* No comment provided by engineer. */
"Host/domain" = "主机/域";

/* No comment provided by engineer. */
"Hosts" = "主机";

/* No comment provided by engineer. */
"HTTPS Everywhere" = "HTTPS Everywhere";

/* No comment provided by engineer. */
"HTTPS Everywhere Rules" = "HTTPS Everywhere 规则";

/* No comment provided by engineer. */
"Ignore for this host" = "忽略来自该主机的错误";

/* No comment provided by engineer. */
"Ignore TLS errors" = "忽略 TLS 错误";

/* No comment provided by engineer. */
"Invalid email address" = "邮箱地址无效";

/* Donate Scene. */
"Loading in-app purchase data…" = "正在加载应用内购买数据……";

/* No comment provided by engineer. */
"Log In" = "登录";

/* InAppSettingsKit */
"Mail not configured" = "邮箱未配置";

/* No comment provided by engineer. */
"Manage Bookmarks" = "管理书签";

/* SettingsViewController */
"Minimum version of TLS required for hosts to negotiate HTTPS connections." = "主机建立 HTTPS 连接所需的 TLS 最低版本";

/* No comment provided by engineer. */
"No" = "否";

/* No comment provided by engineer. */
"No XHR/WebSocket/Video connections" = "无 XHR/WebSocket/视频连接";

/* InAppSettingsKit
   OK action */
"OK" = "确定";

/* No comment provided by engineer. */
"Open" = "打开";

/* No comment provided by engineer. */
"Open (normal browsing mode)" = "打开（正常浏览模式）";

/* No comment provided by engineer. */
"Open in a New Tab" = "在新标签页中打开";

/* No comment provided by engineer. */
"Open in Background Tab" = "在背景标签页中打开";

/* No comment provided by engineer. */
"Open in Safari" = "在 Safari 中打开";

/* No comment provided by engineer. */
"Other" = "其它";

/* No comment provided by engineer. */
"Page bookmarked" = "页面已存为书签";

/* No comment provided by engineer. */
"Page Name (leave blank to use URL)" = "页面名称（空白时使用 URL）";

/* Password */
"Password" = "密码";

/* Donate Scene. */
"Payment Sent" = "已发送款项";

/* No comment provided by engineer. */
"Privacy" = "隐私";

/* No comment provided by engineer. */
"Pull to Refresh Page" = "拉动以刷新页面";

/* Donate Scene. */
"Purchase Failure" = "购买失败";

/* SettingsViewController */
"Rate on App Store" = "在应用商店评价";

/* No comment provided by engineer. */
"Refresh" = "刷新";

/* SettingsViewController */
"Report a Bug" = "报告错误";

/* No comment provided by engineer. */
"Resources loaded from external hosts will be blocked from loading page elements or making requests to LAN hosts (192.168.0.0/16, 172.16.0.0/12, etc.)" = "从外部主机加载的资源将无法加载页面元素或向 LAN 主机（192.168.0.0/16、172.16.0.0/12 等）发出请求";

/* No comment provided by engineer. */
"Resources loaded from this host will be blocked from loading page elements or making requests to LAN hosts (192.168.0.0/16, 172.16.0.0/12, etc.)" = "从该外部主机加载的资源将无法加载页面元素或向 LAN 主机（192.168.0.0/16、172.16.0.0/12 等）发出请求";

/* No comment provided by engineer. */
"Restrictions on resources loaded from web pages" = "对从网页加载资源的限制";

/* No comment provided by engineer. */
"Restrictions on resources loaded from web pages at this host" = "对该主机上从网页加载资源限制";

/* No comment provided by engineer. */
"Rules in use on current page" = "当前页面使用的规则";

/* No comment provided by engineer. */
"Save Image" = "保存图片";

/* SettingsViewController */
"Search Engine" = "搜索引擎";

/* No comment provided by engineer. */
"Security" = "安全";

/* SettingsViewController */
"Send Do-Not-Track Header" = "发送 Do-Not-Track 标头";

/* No comment provided by engineer. */
"Settings" = "设置";

/* No comment provided by engineer. */
"Share URL" = "分享 URL";

/* No comment provided by engineer. */
"Show Bookmarks" = "显示书签";

/* Donate Scene. */
"Sorry, in-app purchase is disabled on your device!" = "抱歉，应用内购买已在你的设备上禁用！";

/* SettingsViewController */
"Stop Auto-Complete at First Dot" = "在第一个点 (.) 处停用自动完成";

/* No comment provided by engineer. */
"Strict (no JavaScript, video, etc.)" = "严格（无 Javascript、视频等）";

/* Donate Scene. */
"Support Onion Browser Development" = "资助洋葱浏览器的开发";

/* No comment provided by engineer. */
"Switch to Tab %d" = "切换至 %d";

/* SettingsViewController */
"Tab Security" = "标签页安全";

/* No comment provided by engineer. */
"These settings will apply to this host and all hosts under it (e.g., \"example.com\" will apply to example.com and www.example.com)" = "这些设置将应用于此主机，及其下的所有主机 （例如，example.com 将应用于 example.com 和 www.example.com）";

/* No comment provided by engineer. */
"These settings will be used as defaults for all hosts unless overridden" = "如果没有进行修改，默认在所有主机上使用这些设置。";

/* InAppSettingsKit */
"This device is not configured for sending Email. Please configure the Mail settings in the Settings app." = "该设备不可发送电子邮件。请修改“设置”下的“邮件”设置。";

/* Donate Scene. */
"Tip: %@" = "赞助：%@";

/* No comment provided by engineer. */
"TLS certificate chain verification error (self-signed certificate?)" = "TLS 证书链验证错误（自签发证书？）";

/* SettingsViewController */
"TLS 1.2 Only" = "仅限 TLS 1.2";

/* SettingsViewController */
"TLS 1.2, 1.1 or 1.0" = "TLS 1.2、1.1 或 1.0";

/* No comment provided by engineer. */
"TLS handshake failed" = "TLS 握手失败";

/* No comment provided by engineer. */
"TLS protocol error" = "TLS 协议错误";

/* SettingsViewController */
"TLS Version" = "TLS 版本";

/* No comment provided by engineer. */
"Universal Link Protection" = "通用链接保护";

/* No comment provided by engineer. */
"Unknown Organization" = "未知组织";

/* No comment provided by engineer. */
"URL" = "URL";

/* No comment provided by engineer. */
"URL Blocker" = "URL 拦截程序";

/* No comment provided by engineer. */
"User Agent" = "用户代理";

/* No comment provided by engineer. */
"User disabled" = "用户已禁用";

/* No comment provided by engineer. */
"Using defaults" = "使用默认";

/* SettingsViewController */
"When disabled, all text entered in search bar will be sent to the search engine unless it starts with \"http\"" = "若禁用，在搜索框输入的全部文本将发送至搜索引擎，“http”开头的除外";

/* No comment provided by engineer. */
"XLFormViewController_ValidationErrorTitle" = "错误";

/* No comment provided by engineer. */
"Yes" = "是";

/* Donate Scene. */
"You most recently donated %@ on %@." = "你最近捐助了 %@ 给 %@。";

/* Donate Scene. */
"__DONATE_EXPLANATION_PARAGRAPH1__" = "洋葱浏览器是一个免费软件，但开发和维护需要时间和精力。";

/* Donate Scene. */
"__DONATE_EXPLANATION_PARAGRAPH2__" = "你可以在下方通过应用内购买，捐赠一小笔钱来支持资助应用。这是一次性、无周期的汇款，但你可以在任何时候再次付款。应用内购买的任何信息都不会被洋葱浏览器的开发者收集或储存。";

/* Donate Scene. */
"__DONATE_EXPLANATION_PARAGRAPH3__" = "你可以在“全局设置”页面的“关于”部分找到其他资助方式（包括 Patreon、PayPal、比特币和 Zcash）。";

/* Donate Scene. */
"__DONATE_THANKS__" = "谢谢您！每一块钱都对我们很有帮助。你资助的 %@ 使得洋葱浏览器和其他让 Tor 能够更便捷地整合到 iOS 应用的工具能够继续开发。";
